Revit 2027 API
Schema.ListSchemas Method
 Lists all schemas in memory.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Schema> ListSchemas()
Public Shared Function ListSchemas As IList(Of Schema)
public:
static IList<Schema^>^ ListSchemas()
static member ListSchemas : unit -> IList<Schema>
Return Value
IList<Schema>
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace